{
    "resume": {
        "fr": "CV",
        "ja": "履歴書",
        "en": "Resume\n\ntest"
    },
    "download": {
        "fr": "Télécharger",
        "ja": "ダウンロード",
        "en": "Download"
    },
    "download-long": {
        "fr": "Télécharger le cv en pdf",
        "ja": "履歴書をpdfでダウンロード",
        "en": "Download resume as pdf"
    },
    "settings": {
        "fr": "Paramètres",
        "ja": "設定",
        "en": "Settings"
    },
    "close": {
        "fr": "Fermer",
        "ja": "閉じる",
        "en": "Close"
    },
    "bio-long": {
        "en": "##### Biography\n\nI wrote my first program during a boring math lecture in junior high school in france, around 2005. I discovered that my TI-82 scientific calculator could be programmed using some limited variant of basic and I became obsessed with it. I learned as much as i could from the manual but quickly hit performance issues as I graduated from writing trivial math programs to attempting to build games.\n\nI used the limited internet access that my family had at the time to research ways to circumvent the issue, only to realize that all the solutions that I could find did not apply to the machine I had. In the process, I stumbled on the \"Site du Zéro\" (now OpenClassroom), the de-facto reference website for french-speaking programming self-learners, where I learned first C, then C++, as those were the only two languages with comprehensive explanations at the time.\n\nFrom then on I kept studying various programming languages and computing science. However as I reached the end of high school, I didn't see it as anything more than a hobby and iIwent on to study management in university.\n\nI moved to Japan in early 2012 as an exchange student, and lived there until mid-2014. I then dropped out of university as I realized that management wasn't my calling and went on to travel the world. From there, I spent a year in South Korea, 5 months in Taiwan and a year in australia, before going back to France in late 2017.\n\nThis was also the moment I decided I would pursue software engineering as a career, after over 13 years of self study. I worked for almost two years as a C++ and C# engineer on desktop applications at Nexter Systems, before growing sufficiently dissatisfied with the management of the IT projects to quit, in december 2019."
    },
    "bio-title": {
        "fr": "Biographie",
        "ja": "自己紹介",
        "en": "Biography"
    },
    "about-me": {
        "fr": "À propos de moi",
        "ja": "自己紹介",
        "en": "About me"
    },
    "bio-short": {
        "en": "After almost 15 years of programming as a passion, I decided a couple years ago to follow my calling and become a full-time software engineer.\n\nI focus on using my long experience and modern tools to build high-reliability, high-maintanability software. I have a particular fondness for C++, Haskell and other strongly typed languages but I have had the occasion to use a wide array of technologies and I am always happy to learn a new skill for a job."
    },
    "address-title": {
        "fr": "Adresse",
        "ja": "住所",
        "en": "Address"
    },
    "address": {
        "ja": "フランス、モンティニー＝ル＝ブルトンヌー",
        "en": "Montigny-le-Bretonneux, France"
    },
    "email": {
        "fr": "E-mail",
        "ja": "メール",
        "en": "Email"
    },
    "birthday-title": {
        "fr": "Date de naissance",
        "ja": "生年月日",
        "en": "Birthday"
    },
    "birthday": {
        "ja": "平成2年３月26日",
        "en": "26/03/1990"
    },
    "blog": {
        "ja": "ブログ",
        "en": "Blog"
    },
    "native": {
        "fr": "Langue maternelle",
        "ja": "母語",
        "en": "Native"
    },
    "french": {
        "fr": "Français",
        "ja": "フランス語",
        "en": "French"
    },
    "english": {
        "fr": "Anglais",
        "ja": "英語",
        "en": "English"
    },
    "japanese": {
        "fr": "Japonais",
        "ja": "日本語",
        "en": "Japanese"
    },
    "near-bilingual": {
        "fr": "Bilingue",
        "en": "Near Bilingual"
    },
    "fluent": {
        "fr": "Courant",
        "en": "Fluent"
    },
    "education": {
        "fr": "Éducation",
        "ja": "教育",
        "en": "Education"
    },
    "formal-education": {
        "fr": "Éducation Académique",
        "ja": "学歴",
        "en": "Formal Education"
    },
    "languages": {
        "fr": "Langues",
        "ja": "語学力",
        "en": "Languages"
    },
    "french-description": {
        "en": "I was born and raised in France, near Paris. Although most of my productions are English, French is my mother tongue."
    },
    "english-description": {
        "en": "I learned English as a teenager watching American TV shows. As my interests expanded into programming and I started living abroad, I naturally had both the incentive and the opportunity to improve my language abilities by reading technical litterature, watching various online content and interacting in English with others.   \nNowadays, most of my life is conducted in English.\n###### Certifications\nTOIEC Passed in 2012 with 990 points."
    },
    "japanese-description": {
        "en": "I started learning Japanese at around 16 years old, but my language ability only really took off during my studies at Meiji University, Japan, between 2012 and 2014. I studied on my own and achieved a fairly high level by the time I left Japan.  \nI have since then done my best to maintain fluency both in speaking and writting.\n###### Certifications\nJLPT N1 Passed in 2014."
    },
    "escem-description": {
        "en": "<a href=\"https://en.wikipedia.org/wiki/Grandes_%C3%A9coles\" target=\"_blank\">Grande école</a> (business school), 4th and 5th semester spent as an exchange student in Meiji University, Japan"
    },
    "escem-title": {
        "en": "Ecole Supérieure de Commerce et de Management"
    },
    "cpge-title": {
        "en": "<a href=\"https://en.wikipedia.org/wiki/Classe_pr%C3%A9paratoire_aux_grandes_%C3%A9coles\" target=\"_blank\">CPGE</a>"
    },
    "cpge-description": {
        "fr": "Voie économique",
        "en": "2 years of preparatory classes for the entrance exams to the french  <a href=\"https://en.wikipedia.org/wiki/Grandes_%C3%A9coles\" target=\"_blank\">grandes écoles</a>"
    },
    "bac-description": {
        "fr": "Voie économique et sociale",
        "en": "French high school degree"
    },
    "bac-title": {
        "en": "<a href=\"https://en.wikipedia.org/wiki/Baccalaur%C3%A9at\" target=\"_blank\">Baccalauréat</a>"
    },
    "conduit-description": {
        "en": "## <a href=\"https://sylvainleclercq.com/conduit.purs\" target=\"_blank\" >Conduit</a>\nConduit is a clone of the popular blogging website Medium, intended to showcase how a real world is implemented using various backend and frontend frameworks. This particular front-end implementation is my own and uses Purescript and Halogen.\n\nFor demonstration purposes, it has the capability of changing the back-end it connects to. By default, the public test API of the Conduit project is selected and shows whatever garbage is currently on the server. A clean database is available through <a href=\"https://github.com/de-passage/conduit-rocket.rust\" target=\"_blank\">my own Rust back-end.</a> The content of the database is reset every 24 hours. In order to use it, select **Custom backend** on the <a href=\"https://sylvainleclercq.com/conduit.purs/#/dev\" target=\"_blank\" >Developers</a> page and set the URL to `https://conduit-rocket.herokuapp.com/api/`. Feel free to <a href=\"https://sylvainleclercq.com/conduit.purs/#/register\" target=\"_blank\">register</a> and play with the app.\n\nThe code for both the front and back-end are available on <a href=\"https://github.com/de-passage/\" target=\"_blank\">my Github</a>.  \nFront-end: \n                <a href=\"https://github.com/de-passage/conduit.purs\" target=\"_blank\">de-passage/conduit.purs</a>  \nBack-end:<a href=\"https://github.com/de-passage/conduit-rocket.rust\" target=\"_blank\">de-passage/conduit-rocket.rust</a>"
    }
}